validation/diluteCoupledHyperbolicFoam/riser/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dilutePhase particles;
rhof    rhof    [1 -3 0 0 0 0 0] 1.4;
rhop    rhop    [1 -3 0 0 0 0 0] 2500;
d       d       [0 1 0 0 0 0 0] 300e-6;
residualAlpha   1e-6;
e       0.9;
phases (air water);

air
{
    type            polydispersePhaseModel;
    residualAlpha   1e-4;
    minD            1e-4;
    maxD            1e-2;
}

water
{
    type            monodispersePhaseModel;
    residualAlpha   1e-4;
    d               1e-4;
}

pMin    1e3;
pMax    1e7;

blending
{
    default
    {
        type                            linear;
        maxFullyDispersedAlpha.air      0.3;
        maxPartlyDispersedAlpha.air     0.5;
        maxFullyDispersedAlpha.water    0.3;
        maxPartlyDispersedAlpha.water   0.5;
    }
}

sigma
(
    (air and water)   0.7
);

aspectRatio
(
    (air in water)
    {
        type            constant;
        E0              1.0;
    }

    (water in air)
    {
        type            constant;
        E0              1.0;
    }
);

drag
(
    (air in water)
    {
        type            SchillerNaumann;
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }

    (water in air)
    {
        type            SchillerNaumann;
        residualRe      1e-3;
        swarmCorrection
        {
            type        none;
        }
    }

    (air and water)
    {
        type            segregated;
        residualRe      1e-3;
        residualAlpha   1e-4;
        m               0.5;
        n               8;
        swarmCorrection
        {
            type        none;
        }
    }
);


turbulentDispersion
(
);

virtualMass
(
);

lift
(
);

wallLubrication
(
);

bubblePressure
(
);
