validation/diluteCoupledHyperbolicFoam/riser/constant/populationBalanceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      populationaBalanceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

populationBalanceModel velocity;

velocityCoeffs
{
    odeCoeffs
    {
        solveODESource off;

        ATol    1.0e-6;
        RTol    1.0e-4;
        fac     0.9;
        facMin  0.1;
        facMax  5.0;
        minLocalDt 1.0e-4;
    }

    collision  on;

    collisionKernel
    {
        collisionKernel esBGK;
        e           0.8;
        tau         tau     [0 0 1 0 0 0 0]     0.18;
    }
}

// ************************************************************************* //
